RED = "\033[91m"
RESET = "\033[0m"
a = float(input("Введите число a:"))
b = float(input("Введите число b:"))
print("Сумма чисел a и b:",a + b)
print("Разность чисел a и b:",a - b)
print("Произведение чисел a и b:",a * b)
if b != 0:
    print("Частное от деления a на b:",a / b)
    print("Остаток от деления a на b:",a % b)
else:
     print(f"Частное от деления a на b:{RED} на ноль делить нельзя:({RESET}")
     print(f"Остаток от деления a на b:{RED} на ноль делить нельзя:({RESET}")
print("Возведение числа a в степень b:",a ** b)